Autodesk.Revit.UI.Selection.Selection.StatusbarTip
The message displayed in the status bar tip when prompting the user to make a selection.
The message is displayed in the status bar at the bottom of the Autodesk Revit UI.

Autodesk.Revit.UI.Selection.Selection.WindowSelect
Allows the user to select elements by a rectangle.
Remarks: Note that the Revit user will not be allowed to select items in the Revit user interface except for Revit
elements. This restriction also prevents users from closing the active document or the Revit application.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user tried to close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns: True if the user selected one or more elements, false if the user selected elsewhere in the UI

Autodesk.Revit.UI.Selection.Selection.PickOne
Allows the user to select one element.
Remarks: Note that the Revit user will not be allowed to select items in the Revit user interface except for Revit
elements. This restriction also prevents users from closing the active document or the Revit application.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user tried to close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns: True if the user selected an element, false if the user selected elsewhere in the UI

Autodesk.Revit.UI.Selection.Selection.PickElementsByRectangle(Autodesk.Revit.UI.Selection.ISelectionFilter,System.String)
Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter while showing a custom status prompt string.
pSelFilter: The selection filter.
statusPrompt: The message shown on the status bar.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the pSelFilter is null or statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of elements selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickElementsByRectangle(Autodesk.Revit.UI.Selection.ISelectionFilter)
Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter.
pSelFilter: The selection filter.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the pSelFilter is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of elements selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObjects(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter,System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string. A preselected set of objects may be supplied and will be selected at the start of the selection.
objectType: Specifies the type of object to be selected.
pSelFilter: The selection filter.
statusPrompt: The message shown on the status bar.
pPreSelected: The previously selected set of objects.
Remarks:
The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation.
Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.
The previously selected set of objects will be highlighted.
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the pSelFilter is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the Revit user cancelled this operation.
Thrown when pPreSelected references has objects that are not the type of objectType.
Thrown when objectType is PointOnElement which is not supported for selection involving preselected items.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of references selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObjects(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter,System.String)
Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string.
objectType: Specifies the type of object to be selected.
pSelFilter: The selection filter.
statusPrompt: The message shown on the status bar.
Remarks:
The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation.
Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the pSelFilter is null or statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of references selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObjects(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter)
Prompts the user to select multiple objects which pass a customer filter.
objectType: Specifies the type of object to be selected.
pSelFilter: The selection filter.
Remarks:
The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation.
Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the pSelFilter is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of references selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObject(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter,System.String)
Prompts the user to select one object which passes a custom filter while showing a custom status prompt string.
objectType: Specifies the type of object to be selected.
pSelFilter: The selection filter.
statusPrompt: The message shown on the status bar.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the pSelFilter is null or statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A reference object selected by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObject(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter)
Prompts the user to select one object which passes a custom filter.
objectType: Specifies the type of object to be selected.
pSelFilter: The selection filter.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the pSelFilter is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A reference object selected by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.